In [7]:
# modules 
import pandas as pd
import os
import numpy as np

In [8]:
# File to Load (Remember to Change These)
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

In [9]:
# Read School and Student Data File and store into Pandas DataFrames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

In [11]:
student_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [12]:
school_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [4]:
school_data_frame = pd.DataFrame(school_data)

In [5]:
# Combine the data into a single dataset. 
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

In [6]:
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [18]:
 ### District summary

In [14]:
#Calculate the total number of schools 
total_schools = school_data_complete["school_name"].nunique()

In [15]:
#Calculate the total number of students
total_students = school_data_complete["Student ID"].nunique()

In [16]:
#Calculate the total budget 
total_budget = school_data["budget"].sum()

In [17]:
#Calculate the average math score 
average_math_score = school_data_complete["math_score"].mean()

In [18]:
#Calculate the average reading score
average_reading_score = school_data_complete["reading_score"].mean()

In [19]:
#Calculate the percentage of students with a passing math score (70 or greater)
passing_Math = len(school_data_complete[school_data_complete["math_score"] >= 70])
students_passing_math = passing_Math / total_students * 100

In [20]:
# Calculate the percentage of students with a passing reading score (70 or greater)
passing_Reading = len(school_data_complete[school_data_complete["reading_score"] >= 70])
students_passing_reading = passing_Reading / total_students * 100

In [33]:
#Calculate the percentage of students who passed math **and** reading (% Overall Passing)
student_passing_math_and_reading = school_data_complete[(school_data_complete['math_score']>=70)
                    & (school_data_complete['reading_score']>=70)]
student_passing_math_and_reading_count=student_passing_math_and_reading['Student ID'].count()
Overall_passing_rate=(student_passing_math_and_reading_count/total_students)*100

In [34]:
#Create a dataframe to hold the above results
District_summary_df = pd.DataFrame({"Total Schools":[total_schools],
                                   "Total Students":[total_students],
                                   "Total Budget":[total_budget],
                                   "Average Math Score":[average_math_score],
                                   "Average Reading Score":[average_reading_score],
                                   "% Passing Math":[students_passing_math],
                                   "% Passing Reading":[students_passing_reading],
                                   "% Overall Passing Rate":[Overall_passing_rate]})

In [35]:
District_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [97]:
### Create an overview table that summarizes key metrics about each school

In [36]:
# by school name and school type
school_name = school_data_complete.set_index('school_name').groupby(['school_name'])
school_type = school_data_complete.set_index('school_name')['type']